# Part I. Pandas Exercise

## Q1-Q5 are basd on the following dataset

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4

Q1. Write a Pandas program to split the above dataframe into groups based on school code and store the results as a list. (You should return a list where each element is a pandas dataframe).

In [1]:
import pandas as pd
pd.set_option('display.max_rows', None)
data = pd.DataFrame({'school':['s001','s002','s003','s001','s002','s004'],
                    'class':['V','V','VI','VI','V','VI'],
                    'name':['Alberto Franco','Gino Mcneill','Ryan Parkes','Eesha Hinton','Gino Mcneill','David Parkes'],
                    'date_Of_Birth':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
                    'age':[12,12,13,13,14,12],
                    'height':[173,192,186,167,151,159],
                    'weight':[35,32,33,30,31,32],
                    'address':['street1','street2','street3','street1','street2','street4']},
                   index = ['S1','S2','S3','S4','S5','S6'])
groups = data.groupby('school')
groups_list = list(groups)
groups_list

[('s001',
     school class            name date_Of_Birth  age  height  weight  address
  S1   s001     V  Alberto Franco    15/05/2002   12     173      35  street1
  S4   s001    VI    Eesha Hinton    25/09/1998   13     167      30  street1),
 ('s002',
     school class          name date_Of_Birth  age  height  weight  address
  S2   s002     V  Gino Mcneill    17/05/2002   12     192      32  street2
  S5   s002     V  Gino Mcneill    11/05/2002   14     151      31  street2),
 ('s003',
     school class         name date_Of_Birth  age  height  weight  address
  S3   s003    VI  Ryan Parkes    16/02/1999   13     186      33  street3),
 ('s004',
     school class          name date_Of_Birth  age  height  weight  address
  S6   s004    VI  David Parkes    15/09/1997   12     159      32  street4)]

Q2. Write a Pandas program to calculate the number of students in each school.

In [2]:
schoolcount = data['school'].value_counts()
schoolcount

s001    2
s002    2
s003    1
s004    1
Name: school, dtype: int64

Q3. Write a single-line Pandas program to calculate the average age, maximal height, and minimal weight in each class (classes with same number but in different schools are treated as different).

In [3]:
stats = data.groupby(['school','class']).agg({'age': 'mean','height': 'max', 'weight':'min'})
stats

               age  height  weight
school class
s001   V      12.0     173      35
       VI     13.0     167      30
s002   V      13.0     192      31
s003   VI     13.0     186      33
s004   VI     12.0     159      32

Q4. Define BMI as the weight/height^2 (kg/m^2). In above table, height is measured by cm and weight is measured by kg). Calculate the average BMI for all the students. (You are required to use apply function in this problem)

In [4]:
def calcBMI(row):
    height = row['height']/100
    weight = row['weight']
    BMI = weight / (height*2)
    return BMI

avgBMI = data.apply(calcBMI, axis=1).mean()
avgBMI

9.438289613973563

Q5. Write a Pandas program to find the school that contains no student whose BMI is above the averaged BMI calculated in Q4.

In [5]:
max_schoolBMI = data.groupby('school').apply(calcBMI).groupby('school').max()
below_avg = max_schoolBMI[max_schoolBMI <= avgBMI].index.tolist()
below_avg

['s003']

## Q6-Q9 are based on the following dataset

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

Q6. Create a Pandas dataframe to store above dataset. The ord_date should be used as row index and stored as timeseries (not stored as character string!)

In [6]:
inventory = pd.DataFrame({'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
                         'purch_amt':[150.50,270.65,65.26,110.50,948.50,2400.60,5760.00,1983.43,2480.40,250.45,75.29,3045.60],
                         'ord_date':['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
                         'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
                         'salesman_id':[5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

inventory['ord_date']=pd.to_datetime(inventory['ord_date'])
inventory.set_index('ord_date', inplace=True)
inventory

            ord_no  purch_amt  customer_id  salesman_id
ord_date
2012-10-05   70001     150.50         3005         5002
2012-09-10   70009     270.65         3001         5005
2012-10-05   70002      65.26         3002         5001
2012-08-17   70004     110.50         3009         5003
2012-09-10   70007     948.50         3005         5002
2012-07-27   70005    2400.60         3007         5001
2012-09-10   70008    5760.00         3002         5001
2012-10-10   70010    1983.43         3004         5006
2012-10-10   70003    2480.40         3009         5003
2012-06-27   70012     250.45         3008         5002
2012-08-17   70011      75.29         3003         5007
2012-04-25   70013    3045.60         3002         5001

Q7. Write a Pandas program to calculate the monthly total purchase amount (purch_amt). You only need to consider the months that exist in above dataset.

In [7]:
monthlytotal = inventory.resample('M')['purch_amt'].sum()
monthlytotal

ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59
Freq: M, Name: purch_amt, dtype: float64

Q8. Use pivot function the re-organize the dataset such that each row represent a salesman, each column represent a customer, and each element in the table represents the purchase amount.

In [8]:
pivot = pd.pivot_table(inventory, values='purch_amt', index='salesman_id', columns='customer_id', aggfunc='sum', fill_value=0)
pivot

customer_id    3001     3002   3003     3004  3005    3007    3008    3009
salesman_id
5001           0.00  8870.86   0.00     0.00     0  2400.6    0.00     0.0
5002           0.00     0.00   0.00     0.00  1099     0.0  250.45     0.0
5003           0.00     0.00   0.00     0.00     0     0.0    0.00  2590.9
5005         270.65     0.00   0.00     0.00     0     0.0    0.00     0.0
5006           0.00     0.00   0.00  1983.43     0     0.0    0.00     0.0
5007           0.00     0.00  75.29     0.00     0     0.0    0.00     0.0

Q9. For each row, let variable "previous_month_sales" be the total purch_amt of the corresponding salesman in previous month. For example, for the first row, salesman_id=5002 and order date is in Oct. Then you need to find the total sales of salesman_id=5002 in Sep. If there is no data, set previous_month_sales as 0. Write a Pandas program to calculate the value of variable previous_month_sales for each row.

In [9]:
inventory = pd.DataFrame({'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
                         'purch_amt':[150.50,270.65,65.26,110.50,948.50,2400.60,5760.00,1983.43,2480.40,250.45,75.29,3045.60],
                         'ord_date':['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
                         'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
                         'salesman_id':[5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

inventory['ord_date'] = pd.to_datetime(inventory['ord_date'])
inventory = inventory.sort_values(['salesman_id', 'ord_date'])

inventory['previous_month_sales'] = inventory.groupby('salesman_id')['purch_amt'].shift()
inventory['previous_month_sales'] = inventory['previous_month_sales'].fillna(0)

inventory

,ord_no,purch_amt,ord_date,customer_id,salesman_id,previous_month_sales
11,70013,3045.60,2012-04-25,3002,5001,0.00
5,70005,2400.60,2012-07-27,3007,5001,3045.60
6,70008,5760.00,2012-09-10,3002,5001,2400.60
2,70002,65.26,2012-10-05,3002,5001,5760.00
9,70012,250.45,2012-06-27,3008,5002,0.00
4,70007,948.50,2012-09-10,3005,5002,250.45
0,70001,150.50,2012-10-05,3005,5002,948.50
3,70004,110.50,2012-08-17,3009,5003,0.00
8,70003,2480.40,2012-10-10,3009,5003,110.50
1,70009,270.65,2012-09-10,3001,5005,0.00
7,70010,1983.43,2012-10-10,3004,5006,0.00
10,70011,75.29,2012-08-17,3003,5007,0.00

## Q10-Q12 are basd on the following two datasets

data1 = {'EmployeeID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
         'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack', 'Kathy', 'Leo'],
         'Age': [25, 30, 35, 40, 45, 50, 55, 28, 48, 60, 32, 42],
         'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Seattle', 'Boston', 'Houston', 'San Francisco', 'Los Angeles', 'New York', 'New York', 'Chicago'],
         'DepartmentID': [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 4, 4]}

data2 = {'EmployeeID': [1, 3, 5, 6, 7, 8, 9, 11, 12, 13],
         'Salary': [50000, 70000, 90000, 95000, 105000, 115000, 125000, 140000, 145000, 110000],
         'Years of Experience': [3, 7, 12, 14, 16, 18, 20, 22, 9, 11],
         'DepartmentID': [1, 3, 2, 3, 1, 2, 3, 1, 4, 4],
         'Performance Score': [3, 4, 3, 4, 5, 5, 4, 5, 4, 4]}

Q10. Merge two data set based on keys: 'EmployeeID' and 'Department'. Only keep the records that exist in both datasets.

In [10]:
data1 = pd.DataFrame({'EmployeeID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
                      'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack', 'Kathy', 'Leo'],
                      'Age': [25, 30, 35, 40, 45, 50, 55, 28, 48, 60, 32, 42],
                      'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Seattle', 'Boston', 'Houston', 'San Francisco', 'Los Angeles', 'New York', 'New York', 'Chicago'],
                      'DepartmentID': [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 4, 4]})

data2 = pd.DataFrame({'EmployeeID': [1, 3, 5, 6, 7, 8, 9, 11, 12, 13],
                      'Salary': [50000, 70000, 90000, 95000, 105000, 115000, 125000, 140000, 145000, 110000],
                      'Years of Experience': [3, 7, 12, 14, 16, 18, 20, 22, 9, 11],
                      'DepartmentID': [1, 3, 2, 3, 1, 2, 3, 1, 4, 4],
                      'Performance Score': [3, 4, 3, 4, 5, 5, 4, 5, 4, 4]})

merged = pd.merge(data1, data2, on = ['EmployeeID', 'DepartmentID'], how = 'inner')
merged

,EmployeeID,Name,Age,City,DepartmentID,Salary,Years of Experience,Performance Score
0,1,Alice,25,New York,1,50000,3,3
1,3,Charlie,35,Los Angeles,3,70000,7,4
2,5,Eva,45,Seattle,2,90000,12,3
3,6,Frank,50,Boston,3,95000,14,4
4,7,Grace,55,Houston,1,105000,16,5
5,8,Hannah,28,San Francisco,2,115000,18,5
6,9,Ian,48,Los Angeles,3,125000,20,4
7,12,Leo,42,Chicago,4,145000,9,4

Q11. Only consider employees with a performance score of 4 or higher. Calculate the average age and median years of experience by department

In [11]:
performance = merged[merged['Performance Score'] >= 4]
high = performance.groupby(['DepartmentID']).agg({'Age': 'mean', 'Years of Experience': 'median'})
high

                    Age  Years of Experience
DepartmentID
1             55.000000                 16.0
2             28.000000                 18.0
3             44.333333                 14.0
4             42.000000                  9.0

Q12. For each department, find the employees with salaries higher than the department average.

In [12]:
data1 = pd.DataFrame({'EmployeeID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
                      'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack', 'Kathy', 'Leo'],
                      'Age': [25, 30, 35, 40, 45, 50, 55, 28, 48, 60, 32, 42],
                      'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Seattle', 'Boston', 'Houston', 'San Francisco', 'Los Angeles', 'New York', 'New York', 'Chicago'],
                      'DepartmentID': [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 4, 4]})

data2 = pd.DataFrame({'EmployeeID': [1, 3, 5, 6, 7, 8, 9, 11, 12, 13],
                      'Salary': [50000, 70000, 90000, 95000, 105000, 115000, 125000, 140000, 145000, 110000],
                      'Years of Experience': [3, 7, 12, 14, 16, 18, 20, 22, 9, 11],
                      'DepartmentID': [1, 3, 2, 3, 1, 2, 3, 1, 4, 4],
                      'Performance Score': [3, 4, 3, 4, 5, 5, 4, 5, 4, 4]})

merged = pd.merge(data1, data2, on = ['EmployeeID', 'DepartmentID'], how = 'inner')

avgsalary = merged.groupby('DepartmentID')['Salary'].mean()
result = merged[merged['Salary'] > merged['DepartmentID'].map(avgsalary)]

result[['DepartmentID', 'Name', 'Salary']]

   DepartmentID    Name  Salary
4             1   Grace  105000
5             2  Hannah  115000
6             3     Ian  125000

# Part II. Functional Programming

Q1. Define a function that doubles even numbers and leaves odd numbers as is and apply it to list [1,2,3,4,5,6,7,8]. You are allowed to use a single-line command.

In [13]:
even = lambda x: x*2 if x%2 == 0 else x
series = pd.Series([1,2,3,4,5,6,7,8]).apply(even)
series

0     1
1     4
2     3
3     8
4     5
5    12
6     7
7    16
dtype: int64

Q2. Use reduce function to write a program that concatenates the strings in the list: ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [14]:
from functools import reduce
strings = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
result = reduce(lambda x,y: x + ' ' + y, strings)
print(result)

The quick brown fox jumps over the lazy dog

Q3. Write a single-line command that involves reduce and map function to calculate the sum of the square of a list [1,2,3,4,5,6,7,8,9,10]

In [15]:
square = reduce(lambda x,y: x + y, map(lambda x: x**2, [1,2,3,4,5,6,7,8,9,10]))
square

385

Q4. Write a higher-order function "compose" that takes functions as input to calculate the composition of functions. Specifically, compose(f,g) should return a function that can calculate the composition f(g(x)). 
Use your "compose" function to calculate exp(abs(-3)). (exp denotes exponential function, abs denotes the absolute value function)

In [16]:
def compose(f,g):
    return lambda x: f(g(x))

import math
f = math.exp
g = abs
h = compose(f,g)
result = h(-3)
result

20.085536923187668

Q5. Write a single-line command to generate the value of f(g(x)) for a list [1,2,3,4,5], where f(x)=x**2, g(x)=x+1 (you can use the function defined in Q4)

In [17]:
result = list(map(lambda x: (x+1)**2, [1,2,3,4,5]))
result

[4, 9, 16, 25, 36]